spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_associated_with_the_user.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_16NUyCKpQyEhIGsiKDBkmRDf
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_WvHVe4zkGEUgzLLAJzXdlR0C
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.1.6 p336 (2015-04-13)","platform":"x86_64-darwin14.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        Erics-Air 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44 PDT 2014;
        root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Erics-Air"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 12 Jul 2015 00:48:55 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1982'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6ak80NSHBrZ1qG
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_16NUyCKpQyEhIGsiKDBkmRDf",
          "created": 1436647992,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_16NUyCKpQyEhIGsiajQi2kWW",
              "object": "charge",
              "created": 1436647992,
              "livemode": false,
              "paid": true,
              "status": "succeeded",
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "source": {
                "id": "card_16NUyBKpQyEhIGsi4eOrrKJh",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 7,
                "exp_year": 2016,
                "fingerprint": "HBBO0JBqFDkh0W8t",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6agKepo4dELsUF"
              },
              "captured": true,
              "balance_transaction": "txn_16NUyCKpQyEhIGsiHdXHvuAr",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_6agKepo4dELsUF",
              "invoice": "in_16NUyCKpQyEhIGsifTo22SkA",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "myflix",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "destination": null,
              "application_fee": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_16NUyCKpQyEhIGsiajQi2kWW/refunds",
                "data": []
              }
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "req_6agK2ZbN4OyNiJ",
          "api_version": "2015-06-15"
        }
    http_version: 
  recorded_at: Sun, 12 Jul 2015 00:49:53 GMT
recorded_with: VCR 2.9.3
